; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=29, out_folder=htg/blocksworld//training, instance_id=9, seed=2033

(define (problem blocksworld-09)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b11)
    (on-table b11)
    (clear b21)
    (on b21 b22)
    (on b22 b28)
    (on b28 b20)
    (on b20 b15)
    (on b15 b9)
    (on b9 b1)
    (on b1 b2)
    (on-table b2)
    (clear b6)
    (on b6 b17)
    (on b17 b16)
    (on b16 b24)
    (on b24 b3)
    (on b3 b10)
    (on b10 b27)
    (on b27 b25)
    (on b25 b8)
    (on b8 b26)
    (on b26 b12)
    (on b12 b29)
    (on b29 b7)
    (on b7 b23)
    (on b23 b18)
    (on b18 b19)
    (on b19 b13)
    (on b13 b4)
    (on b4 b5)
    (on b5 b14)
    (on-table b14))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2))))

; plan
1. (unstack b21 b22)
   deleted: (on b21 b22) (clear b21) (arm-empty)
   added: (holding b21) (clear b22)
   goals met: 2 of 3
2. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 3
3. (unstack b22 b28)
   deleted: (on b22 b28) (clear b22) (arm-empty)
   added: (holding b22) (clear b28)
   goals met: 2 of 3
4. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 3
5. (unstack b28 b20)
   deleted: (on b28 b20) (clear b28) (arm-empty)
   added: (holding b28) (clear b20)
   goals met: 2 of 3
6. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 2 of 3
7. (unstack b20 b15)
   deleted: (on b20 b15) (clear b20) (arm-empty)
   added: (holding b20) (clear b15)
   goals met: 2 of 3
8. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 3
9. (unstack b15 b9)
   deleted: (on b15 b9) (clear b15) (arm-empty)
   added: (holding b15) (clear b9)
   goals met: 2 of 3
10. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 3
11. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 3 of 3
